app/views/users/index.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = ?  [["user_id", 1]]
---
        <td><%= user.email %></td>
        <td><%= user.roles.pluck(:name).join(",") %></td>