app/controllers/roles_controller.rb

  def show
    @role = Role.find(params[:id])
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Officer"], ["active", 0], ["created_at", "2020-07-25 13:20:15.794988"], ["updated_at", "2020-07-25 13:20:15.794988"]]

  def update
    respond_to do |format|
      if @role.update(active_params)
---
UPDATE "roles" SET "active" = ?, "updated_at" = ? WHERE "roles"."id" = ?  [["active", 1], ["updated_at", "2020-07-25 13:07:25.854201"], ["id", 2]]

  def destroy
    @role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 4]]