app/controllers/users_controller.rb

INSERT INTO "user_images" ("user_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["image_url", "fsd"], ["created_at", "2020-07-25 13:45:30.183835"], ["updated_at", "2020-07-25 13:45:30.183835"]]
INSERT INTO "user_roles" ("user_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["role_id", 2], ["created_at", "2020-07-25 13:34:25.056591"], ["updated_at", "2020-07-25 13:34:25.056591"]]
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Tetst"], ["last_name", "ytdac"], ["email", "test@test.com"], ["created_at", "2020-07-25 11:58:45.551480"], ["updated_at", "2020-07-25 11:58:45.551480"]]
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Tetst456"], ["last_name", "ytdacefs"], ["email", "suma2@test.com"], ["created_at", "2020-07-25 13:34:25.027036"], ["updated_at", "2020-07-25 13:34:25.027036"]]
INSERT INTO "user_images" ("user_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["image_url", "sds"], ["created_at", "2020-07-25 13:47:26.999584"], ["updated_at", "2020-07-25 13:47:26.999584"]]
---
  def create
    @roles = Role.inactive
    @user = User.new(user_params.except(:image_urls, :role_ids))
    respond_to do |format|
      if @user.save
        user_params["role_ids"].split(',').each do |id|
          @user.user_roles.create(role_id: id)
        end
        user_params["image_urls"].split(',').each do |url|
          @user.user_images.create(image_url: url)

SELECT "user_roles"."user_id" FROM "user_roles"
---
  def users_without_roles
    @users = User.where.not(id: UserRole.pluck(:user_id))